AR_refined/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-20 0 0)   //0 - bottom of main reactor
    (-6.5 0 0)   //1
    (6.5 0 0)   //2
    (20 0 0)    //3

    (-20 240 0)   //4 - top of main reactor
    (20 240 0)    //5

    (-6.5 -58 0)  //6 - bottom of water inlet block (1 inlet, co-axial with main reactor)
    (6.5 -58 0)   //7

    (-6.5 -18 0)  //8 - lower intersection of oil and water inlet blocks
    (6.5 -18 0)   //9

    (-6.5 -13 0)  //10 - upper intersection of oil and water inlet blocks
    (6.5 -13 0)   //11

    (-26.5 -18 0)  //12 - lower points of oil inlets (2 inlets, symmetric about water inlet)
    (26.5 -18 0)   //13

    (-26.5 -13 0)  //14 - upper points of oil inlets (2 inlets, symmetric about water inlet)
    (26.5 -13 0)   //15

    // In z direction

    (-20 0 -1)   //16 - bottom of main reactor
     (-6.5 0 -1)   //17
    (6.5 0 -1)   //18
    (20 0 -1)    //19

    (-20 240 -1)   //20 - top of main reactor
    (20 240 -1)    //21

    (-6.5 -58 -1)  //22 - bottom of water inlet block (1 inlet, co-axial with main reactor)
    (6.5 -58 -1)   //23

    (-6.5 -18 -1)  //24 - lower intersection of oil and water inlet blocks
    (6.5 -18 -1)   //25

    (-6.5 -13 -1)  //26 - upper intersection of oil and water inlet blocks
    (6.5 -13 -1)   //27

    (-26.5 -18 -1)  //28 - lower points of oil inlets (2 inlets, symmetric about water inlet)
    (26.5 -18 -1)   //29

    (-26.5 -13 -1)  //30 - upper points of oil inlets (2 inlets, symmetric about water inlet)
    (26.5 -13 -1)   //31

    (-6.5 240 0)  //32
    (6.5 240 0)  //33
    (-6.5 240 -1)  //34
    (6.5 240 -1)  //35
);

blocks
(
    //water inlet block1
    hex (26 27 18 17 10 11 2 1) (104 104 1) simpleGrading (1 1 1)

    //water inlet block2
    hex (24 25 27 26 8 9 11 10) (104 40 1) simpleGrading (1 1 1)

    //water inlet block3
    hex (22 23 25 24 6 7 9 8) (104 320 1) simpleGrading (1 1 1)
 
    // oil inlet block left
    hex (28 24 26 30 12 8 10 14) (160 40 1) simpleGrading (1 1 1)

    // oil inlet block right
    hex (25 29 31 27 9 13 15 11) (160 40 1) simpleGrading (1 1 1)
 
    // main reactor block 1
    hex (16 17 34 20 0 1 32 4) (108 1920 1)  simpleGrading (1 1 1)

    // main reactor block 2
    hex (17 18 35 34 1 2 33 32) (104 1920 1)  simpleGrading (1 1 1)

    // main reactor block 3
    hex (18 19 21 35 2 3 5 33) (108 1920 1)  simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    waterInlet
    {
        type patch;
        faces
        (
            (7 6 22 23)
        );
    }

    oilInletLeft
    {
        type patch;
        faces
        (
            (12 14 30 28)
        );
    }

    oilInletRight
    {
        type patch;
        faces
        (
            (29 31 15 13)
        );
    }

    mainReactorOutlet
    {
        type patch;
        faces
        (
            (4 32 34 20)
            (32 33 35 34)
            (33 5 21 35)
        );
    }

    wall
    {
       type patch;
       faces
       (
           (0 4 20 16)
           (3 19 21 5)
           (1 0 16 17)
           (10 1 17 26)
           (14 10 26 30)
           (8 12 28 24)
           (6 8 24 22)
           (7 23 25 9)
           (13 9 25 29)
           (11 15 31 27)
           (11 27 18 2)
           (2 18 19 3)
       );
     }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 32 4) // main reactor
            (1 2 33 32)
            (2 3 5 33)
            (17 16 20 34)
            (18 17 34 35)
            (19 18 35 21)
	    (6 7 9 8) // water inlet
 	    (8 9 11 10)
	    (10 11 2 1)
	    (22 24 25 23)
	    (25 24 26 27)
	    (27 26 17 18)
            (12 8 10 14) // oil Inlet Left
            (24 28 30 26)
            (9 13 15 11) // oil Inlet Right
	    (29 25 27 31)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
