AR_refined/system/AR20July.mcr
#!MC 1410
$!GlobalRGB RedChannelVar = 4
$!GlobalRGB GreenChannelVar = 4
$!GlobalRGB BlueChannelVar = 4
$!SetContourVar 
  Var = 4
  ContourGroup = 1
  LevelInitMode = ResetToNice
$!SetContourVar 
  Var = 5
  ContourGroup = 2
  LevelInitMode = ResetToNice
$!SetContourVar 
  Var = 9
  ContourGroup = 3
  LevelInitMode = ResetToNice
$!SetContourVar 
  Var = 10
  ContourGroup = 4
  LevelInitMode = ResetToNice
$!SetContourVar 
  Var = 11
  ContourGroup = 5
  LevelInitMode = ResetToNice
$!SetContourVar 
  Var = 12
  ContourGroup = 6
  LevelInitMode = ResetToNice
$!SetContourVar 
  Var = 13
  ContourGroup = 7
  LevelInitMode = ResetToNice
$!SetContourVar 
  Var = 14
  ContourGroup = 8
  LevelInitMode = ResetToNice
$!SliceLayers Show = Yes
$!FieldLayers ShowShade = No
$!SliceAttributes 1  SliceSurface = ZPlanes
$!SliceAttributes 1  EdgeLayer{Show = Yes}
$!SliceAttributes 1  EdgeLayer{LineThickness = 0.10000000000000001}
$!SliceAttributes 1  Contour{ContourType = BothLinesAndFlood}
$!SetContourVar 
  Var = 11
  ContourGroup = 1
  LevelInitMode = ResetToNice
$!ContourLevels New
  ContourGroup = 1
  RawData
101
0
0.01
0.02
0.03
0.04
0.05
0.06
0.07
0.08
0.09
0.1
0.11
0.12
0.13
0.14
0.15
0.16
0.17
0.18
0.19
0.2
0.21
0.22
0.23
0.24
0.25
0.26
0.27
0.28
0.29
0.3
0.31
0.32
0.33
0.34
0.35
0.36
0.37
0.38
0.39
0.4
0.41
0.42
0.43
0.44
0.45
0.46
0.47
0.48
0.49
0.5
0.51
0.52
0.53
0.54
0.55
0.56
0.57
0.58
0.59
0.6
0.61
0.62
0.63
0.64
0.65
0.66
0.67
0.68
0.69
0.7
0.71
0.72
0.73
0.74
0.75
0.76
0.77
0.78
0.79
0.8
0.81
0.82
0.83
0.84
0.85
0.86
0.87
0.88
0.89
0.9
0.91
0.92
0.93
0.94
0.95
0.96
0.97
0.98
0.99
1
$!GlobalContour 1  ColorMapName = 'Hot Metal'
$!GlobalContour 1  ColorMapFilter{ReverseColorMap = Yes}
$!GlobalContour 1  Legend{AutoResize = Yes}
$!SetContourVar 
  Var = 14
  ContourGroup = 2
  LevelInitMode = ResetToNice
$!GlobalContour 2  Legend{AutoResize = Yes}
$!ContourLevels New
  ContourGroup = 2
  RawData
101
0
0.1
0.2
0.3
0.4
0.5
0.6
0.7
0.8
0.9
1
1.1
1.2
1.3
1.4
1.5
1.6
1.7
1.8
1.9
2
2.1
2.2
2.3
2.4
2.5
2.6
2.7
2.8
2.9
3
3.1
3.2
3.3
3.4
3.5
3.6
3.7
3.8
3.9
4
4.1
4.2
4.3
4.4
4.5
4.6
4.7
4.8
4.9
5
5.1
5.2
5.3
5.4
5.5
5.6
5.7
5.8
5.9
6
6.1
6.2
6.3
6.4
6.5
6.6
6.7
6.8
6.9
7
7.1
7.2
7.3
7.4
7.5
7.6
7.7
7.8
7.9
8
8.1
8.2
8.3
8.4
8.5
8.6
8.7
8.8
8.9
9
9.1
9.2
9.3
9.4
9.5
9.6
9.7
9.8
9.9
10
$!GlobalContour 2  ColorMapName = 'Hot Metal'
$!GlobalContour 2  ColorMapFilter{ReverseColorMap = Yes}
$!SetContourVar 
  Var = 11
  ContourGroup = 3
  LevelInitMode = ResetToNice
$!ContourLevels DeleteRange
  ContourGroup = 3
  RangeMin = 0.0495
  RangeMax = 0.9505
$!ContourLevels Add
  ContourGroup = 3
  RawData
1
0.25
$!GlobalContour 3  Legend{Show = No}
$!SetContourVar 
  Var = 9
  ContourGroup = 1
  LevelInitMode = ResetToNice
$!ContourLevels New
  ContourGroup = 1
  RawData
101
0
0.01
0.02
0.03
0.04
0.05
0.06
0.07
0.08
0.09
0.1
0.11
0.12
0.13
0.14
0.15
0.16
0.17
0.18
0.19
0.2
0.21
0.22
0.23
0.24
0.25
0.26
0.27
0.28
0.29
0.3
0.31
0.32
0.33
0.34
0.35
0.36
0.37
0.38
0.39
0.4
0.41
0.42
0.43
0.44
0.45
0.46
0.47
0.48
0.49
0.5
0.51
0.52
0.53
0.54
0.55
0.56
0.57
0.58
0.59
0.6
0.61
0.62
0.63
0.64
0.65
0.66
0.67
0.68
0.69
0.7
0.71
0.72
0.73
0.74
0.75
0.76
0.77
0.78
0.79
0.8
0.81
0.82
0.83
0.84
0.85
0.86
0.87
0.88
0.89
0.9
0.91
0.92
0.93
0.94
0.95
0.96
0.97
0.98
0.99
1
$!SetContourVar 
  Var = 11
  ContourGroup = 1
  LevelInitMode = ResetToNice
$!ContourLevels New
  ContourGroup = 1
  RawData
101
0
0.01
0.02
0.03
0.04
0.05
0.06
0.07
0.08
0.09
0.1
0.11
0.12
0.13
0.14
0.15
0.16
0.17
0.18
0.19
0.2
0.21
0.22
0.23
0.24
0.25
0.26
0.27
0.28
0.29
0.3
0.31
0.32
0.33
0.34
0.35
0.36
0.37
0.38
0.39
0.4
0.41
0.42
0.43
0.44
0.45
0.46
0.47
0.48
0.49
0.5
0.51
0.52
0.53
0.54
0.55
0.56
0.57
0.58
0.59
0.6
0.61
0.62
0.63
0.64
0.65
0.66
0.67
0.68
0.69
0.7
0.71
0.72
0.73
0.74
0.75
0.76
0.77
0.78
0.79
0.8
0.81
0.82
0.83
0.84
0.85
0.86
0.87
0.88
0.89
0.9
0.91
0.92
0.93
0.94
0.95
0.96
0.97
0.98
0.99
1
$!SetContourVar 
  Var = 9
  ContourGroup = 4
  LevelInitMode = ResetToNice
$!ContourLevels New
  ContourGroup = 4
  RawData
101
0
0.01
0.02
0.03
0.04
0.05
0.06
0.07
0.08
0.09
0.1
0.11
0.12
0.13
0.14
0.15
0.16
0.17
0.18
0.19
0.2
0.21
0.22
0.23
0.24
0.25
0.26
0.27
0.28
0.29
0.3
0.31
0.32
0.33
0.34
0.35
0.36
0.37
0.38
0.39
0.4
0.41
0.42
0.43
0.44
0.45
0.46
0.47
0.48
0.49
0.5
0.51
0.52
0.53
0.54
0.55
0.56
0.57
0.58
0.59
0.6
0.61
0.62
0.63
0.64
0.65
0.66
0.67
0.68
0.69
0.7
0.71
0.72
0.73
0.74
0.75
0.76
0.77
0.78
0.79
0.8
0.81
0.82
0.83
0.84
0.85
0.86
0.87
0.88
0.89
0.9
0.91
0.92
0.93
0.94
0.95
0.96
0.97
0.98
0.99
1
$!GlobalContour 4  ColorMapName = 'Hot Metal'
$!GlobalContour 4  ColorMapFilter{ReverseColorMap = Yes}
$!SetContourVar 
  Var = 18
  ContourGroup = 5
  LevelInitMode = ResetToNice
$!ContourLevels New
  ContourGroup = 5
  RawData
9
0
2500
5000
7500
10000
12500
15000
17500
20000
$!GlobalContour 5  ColorMapName = 'Modified Rainbow - Dark ends'
$!ContourLevels New
  ContourGroup = 5
  RawData
202
0
99.5024875622
199.004975124
298.507462687
398.009950249
497.512437811
597.014925373
696.517412935
796.019900498
895.52238806
995.024875622
1094.52736318
1194.02985075
1293.53233831
1393.03482587
1492.53731343
1592.039801
1691.54228856
1791.04477612
1890.54726368
1990.04975124
2089.55223881
2189.05472637
2288.55721393
2388.05970149
2487.56218905
2587.06467662
2686.56716418
2786.06965174
2885.5721393
2985.07462687
3084.57711443
3184.07960199
3283.58208955
3383.08457711
3482.58706468
3582.08955224
3681.5920398
3781.09452736
3880.59701493
3980.09950249
4079.60199005
4179.10447761
4278.60696517
4378.10945274
4477.6119403
4577.11442786
4676.61691542
4776.11940299
4875.62189055
4975.12437811
5074.62686567
5174.12935323
5273.6318408
5373.13432836
5472.63681592
5572.13930348
5671.64179104
5771.14427861
5870.64676617
5970.14925373
6069.65174129
6169.15422886
6268.65671642
6368.15920398
6467.66169154
6567.1641791
6666.66666667
6766.16915423
6865.67164179
6965.17412935
7064.67661692
7164.17910448
7263.68159204
7363.1840796
7462.68656716
7562.18905473
7661.69154229
7761.19402985
7860.69651741
7960.19900498
8059.70149254
8159.2039801
8258.70646766
8358.20895522
8457.71144279
8557.21393035
8656.71641791
8756.21890547
8855.72139303
8955.2238806
9054.72636816
9154.22885572
9253.73134328
9353.23383085
9452.73631841
9552.23880597
9651.74129353
9751.24378109
9850.74626866
9950.24875622
10049.7512438
10149.2537313
10248.7562189
10348.2587065
10447.761194
10547.2636816
10646.7661692
10746.2686567
10845.7711443
10945.2736318
11044.7761194
11144.278607
11243.7810945
11343.2835821
11442.7860697
11542.2885572
11641.7910448
11741.2935323
11840.7960199
11940.2985075
12039.800995
12139.3034826
12238.8059701
12338.3084577
12437.8109453
12537.3134328
12636.8159204
12736.318408
12835.8208955
12935.3233831
13034.8258706
13134.3283582
13233.8308458
13333.3333333
13432.8358209
13532.3383085
13631.840796
13731.3432836
13830.8457711
13930.3482587
14029.8507463
14129.3532338
14228.8557214
14328.358209
14427.8606965
14527.3631841
14626.8656716
14726.3681592
14825.8706468
14925.3731343
15024.8756219
15124.3781095
15223.880597
15323.3830846
15422.8855721
15522.3880597
15621.8905473
15721.3930348
15820.8955224
15920.39801
16019.9004975
16119.4029851
16218.9054726
16318.4079602
16417.9104478
16517.4129353
16616.9154229
16716.4179104
16815.920398
16915.4228856
17014.9253731
17114.4278607
17213.9303483
17313.4328358
17412.9353234
17512.4378109
17611.9402985
17711.4427861
17810.9452736
17910.4477612
18009.9502488
18109.4527363
18208.9552239
18308.4577114
18407.960199
18507.4626866
18606.9651741
18706.4676617
18805.9701493
18905.4726368
19004.9751244
19104.4776119
19203.9800995
19303.4825871
19402.9850746
19502.4875622
19601.9900498
19701.4925373
19800.9950249
19900.4975124
20000
$!GlobalContour 5  Legend{AutoResize = Yes}
$!SetContourVar 
  Var = 25
  ContourGroup = 6
  LevelInitMode = ResetToNice
$!GlobalContour 6  Legend{AutoResize = Yes}
$!ContourLevels New
  ContourGroup = 6
  RawData
101
0
0.4
0.8
1.2
1.6
2
2.4
2.8
3.2
3.6
4
4.4
4.8
5.2
5.6
6
6.4
6.8
7.2
7.6
8
8.4
8.8
9.2
9.6
10
10.4
10.8
11.2
11.6
12
12.4
12.8
13.2
13.6
14
14.4
14.8
15.2
15.6
16
16.4
16.8
17.2
17.6
18
18.4
18.8
19.2
19.6
20
20.4
20.8
21.2
21.6
22
22.4
22.8
23.2
23.6
24
24.4
24.8
25.2
25.6
26
26.4
26.8
27.2
27.6
28
28.4
28.8
29.2
29.6
30
30.4
30.8
31.2
31.6
32
32.4
32.8
33.2
33.6
34
34.4
34.8
35.2
35.6
36
36.4
36.8
37.2
37.6
38
38.4
38.8
39.2
39.6
40
$!GlobalContour 6  ColorMapName = 'Modified Rainbow - Less Green'
$!SetContourVar 
  Var = 6
  ContourGroup = 7
  LevelInitMode = ResetToNice
$!SetContourVar 
  Var = 7
  ContourGroup = 7
  LevelInitMode = ResetToNice
$!ContourLevels New
  ContourGroup = 7
  RawData
102
-1.5
-1.46534653465
-1.43069306931
-1.39603960396
-1.36138613861
-1.32673267327
-1.29207920792
-1.25742574257
-1.22277227723
-1.18811881188
-1.15346534653
-1.11881188119
-1.08415841584
-1.0495049505
-1.01485148515
-0.980198019802
-0.945544554455
-0.910891089109
-0.876237623762
-0.841584158416
-0.806930693069
-0.772277227723
-0.737623762376
-0.70297029703
-0.668316831683
-0.633663366337
-0.59900990099
-0.564356435644
-0.529702970297
-0.49504950495
-0.460396039604
-0.425742574257
-0.391089108911
-0.356435643564
-0.321782178218
-0.287128712871
-0.252475247525
-0.217821782178
-0.183168316832
-0.148514851485
-0.113861386139
-0.0792079207921
-0.0445544554455
-0.00990099009901
0.0247524752475
0.0594059405941
0.0940594059406
0.128712871287
0.163366336634
0.19801980198
0.232673267327
0.267326732673
0.30198019802
0.336633663366
0.371287128713
0.405940594059
0.440594059406
0.475247524752
0.509900990099
0.544554455446
0.579207920792
0.613861386139
0.648514851485
0.683168316832
0.717821782178
0.752475247525
0.787128712871
0.821782178218
0.856435643564
0.891089108911
0.925742574257
0.960396039604
0.99504950495
1.0297029703
1.06435643564
1.09900990099
1.13366336634
1.16831683168
1.20297029703
1.23762376238
1.27227722772
1.30693069307
1.34158415842
1.37623762376
1.41089108911
1.44554455446
1.4801980198
1.51485148515
1.5495049505
1.58415841584
1.61881188119
1.65346534653
1.68811881188
1.72277227723
1.75742574257
1.79207920792
1.82673267327
1.86138613861
1.89603960396
1.93069306931
1.96534653465
2
$!GlobalContour 7  ColorMapName = 'Modified Rainbow - Dark ends'
$!GlobalContour 7  Legend{AutoResize = Yes}
$!SetContourVar 
  Var = 34
  ContourGroup = 8
  LevelInitMode = ResetToNice
$!GlobalContour 8  Legend{AutoResize = Yes}
$!SetContourVar 
  Var = 33
  ContourGroup = 8
  LevelInitMode = ResetToNice
$!ContourLevels New
  ContourGroup = 8
  RawData
101
29999000
29999020
29999040
29999060
29999080
29999100
29999120
29999140
29999160
29999180
29999200
29999220
29999240
29999260
29999280
29999300
29999320
29999340
29999360
29999380
29999400
29999420
29999440
29999460
29999480
29999500
29999520
29999540
29999560
29999580
29999600
29999620
29999640
29999660
29999680
29999700
29999720
29999740
29999760
29999780
29999800
29999820
29999840
29999860
29999880
29999900
29999920
29999940
29999960
29999980
30000000
30000020
30000040
30000060
30000080
30000100
30000120
30000140
30000160
30000180
30000200
30000220
30000240
30000260
30000280
30000300
30000320
30000340
30000360
30000380
30000400
30000420
30000440
30000460
30000480
30000500
30000520
30000540
30000560
30000580
30000600
30000620
30000640
30000660
30000680
30000700
30000720
30000740
30000760
30000780
30000800
30000820
30000840
30000860
30000880
30000900
30000920
30000940
30000960
30000980
30001000
$!GlobalContour 8  ColorMapName = 'Modified Rainbow - Dark ends'
$!SliceAttributes 1  Contour{FloodColoring = Group4}
$!SliceAttributes 1  Contour{LineContourGroup = 3}
$!ThreeDView ViewerPosition{X = 0}
$!ThreeDView ViewerPosition{Y = 0.090999998152255901}
$!ThreeDView ViewerPosition{Z = 0.0092968240240989767}
$!ThreeDView PSIAngle = 0
$!ThreeDView ThetaAngle = 0
